[
  {
    "id": "8c1ece5beaf6d54df57806761cbfb355",
    "title": "Civil Engineering Materials Laboratory",
    "description": "This course introduces the concepts, techniques, and devices used to measure engineering properties of materials. There is an emphasis on measurement of load-deformation characteristics and failure modes of both natural and fabricated materials. Weekly experiments include data collection, data analysis, and interpretation and presentation of results.",
    "authors": [
      "Dr. John Germaine",
      "John Germaine\n\n\n\n\n\n\n                Departments\n              \n\n\n\nCivil"
    ],
    "subject": [
      "Civil and Environmental Engineering",
      "Engineering",
      "Civil Engineering",
      "Materials Science and Engineering"
    ],
    "source": "MIT",
    "url": "https://ocw.mit.edu/courses/1-103-civil-engineering-materials-laboratory-spring-2004/",
    "url_pdf": "",
    "scraped_at": "2025-09-17T06:28:31.125820"
  },
  {
    "id": "e4c67cde66bb0dcda7e80c7b6b7eb8bf",
    "title": "Public Transportation Systems",
    "description": "This course discusses the evolution and role of urban public transportation modes, systems, and services, focusing on bus and rail. It covers various topics, including current practice and new methods for data collection and analysis, performance monitoring, route design, frequency determination, vehicle and crew scheduling, effect of pricing policy and service quality on ridership.",
    "authors": [
      "Prof. Nigel Wilson",
      "Dr. Gabriel E. Sanchez-Martinez",
      "Dr. Neema Nassir"
    ],
    "subject": [
      "Civil and Environmental EngineeringUrban Studies and Planning",
      "Engineering",
      "Civil Engineering",
      "Transportation Engineering",
      "Social Science",
      "Urban Studies",
      "Transportation Planning"
    ],
    "source": "MIT",
    "url": "https://ocw.mit.edu/courses/1-258j-public-transportation-systems-spring-2017/",
    "url_pdf": "",
    "scraped_at": "2025-09-17T06:28:34.668195"
  },
  {
    "id": "f43b30b870bdf55e466ab6c8df03a12b",
    "title": "Airline Schedule Planning",
    "description": "Explores a variety of models and optimization techniques for the solution of airline schedule planning and operations problems. Schedule design, fleet assignment, aircraft maintenance routing, crew scheduling, passenger mix, and other topics are covered. Recent models and algorithms addressing issues of model integration, robustness, and operations recovery are introduced. Modeling and solution techniques designed specifically for large-scale problems, and state-of-the-art applications of these techniques to airline problems are detailed.",
    "authors": [
      "Prof. Cynthia Barnhart",
      "Cynthia Barnhart\n\n\n\n\n\n\n                Departments\n              \n\n\n\nCivil",
      "Environmental Engineering\n\n\nAeronautics"
    ],
    "subject": [
      "Civil and Environmental EngineeringAeronautics and AstronauticsEngineering Systems Division",
      "Engineering",
      "Systems Engineering",
      "Systems Optimization",
      "Social Science",
      "Urban Studies",
      "Transportation Planning"
    ],
    "source": "MIT",
    "url": "https://ocw.mit.edu/courses/1-206j-airline-schedule-planning-spring-2003/",
    "url_pdf": "",
    "scraped_at": "2025-09-17T06:28:38.071034"
  },
  {
    "id": "faba8fc340b09aac2b0e11b40efcab66",
    "title": "Water Resource Systems",
    "description": "This subject is concerned with quantitative methods for analyzing large-scale water resource problems. Topics covered include the design and management of facilities for river basin development, flood control, water supply, groundwater remediation, and other activities related to water resources. Simulation models and optimization methods are often used to support analyses of water resource problems. In this subject we will be constructing simulation models with the MATLAB® programming language and solving numerical optimization problems with the GAMS optimization package.",
    "authors": [
      "Prof. Dennis McLaughlin"
    ],
    "subject": [
      "Civil and Environmental Engineering",
      "Engineering",
      "Environmental Engineering",
      "Aquatic Sciences and Water Quality Control",
      "Hydrodynamics and Coastal Engineering",
      "Hydrology and Water Resource Systems"
    ],
    "source": "MIT",
    "url": "https://ocw.mit.edu/courses/1-731-water-resource-systems-fall-2006/",
    "url_pdf": "",
    "scraped_at": "2025-09-17T06:28:41.657099"
  },
  {
    "id": "8b33ee577e7ed506e2d26c58b0a44ee4",
    "title": "An Introduction to Intelligent Transportation Systems",
    "description": "Intelligent Transportation Systems (ITS) represent a major transition in transportation on many dimensions. This course considers ITS as a lens through which one can view many transportation and societal issues. ITS is an international program intended to improve the effectiveness and efficiency of surface transportation systems through advanced technologies in information systems, communications, and sensors. In the United States, ITS represents the major post-Interstate-era program for advancing surface transportation in highways and public transportation, and is potentially comparable to the air traffic control system in impact. The readings for the class come primarily from the instructor's own text: Sussman, Joseph. [_Perspectives on Intelligent Transportation Systems (ITS)_](http://www.springeronline.com/sgw/cda/frontpage/0,11855,4-40109-22-35352196-0,00.html). New York, NY: Springer, 2005. ISBN: 0387232575.",
    "authors": [
      "Prof. Joseph Sussman",
      "Joseph Sussman\n\n\n\n\n\n\n                Departments\n              \n\n\n\nCivil"
    ],
    "subject": [
      "Civil and Environmental EngineeringEngineering Systems Division",
      "Engineering",
      "Civil Engineering",
      "Transportation Engineering",
      "Social Science",
      "Urban Studies",
      "Transportation Planning"
    ],
    "source": "MIT",
    "url": "https://ocw.mit.edu/courses/1-212j-an-introduction-to-intelligent-transportation-systems-spring-2005/",
    "url_pdf": "",
    "scraped_at": "2025-09-17T06:28:44.438527"
  },
  {
    "id": "de3174c222c36f6a37e9f41a6a30af06",
    "title": "Computer Algorithms in Systems Engineering",
    "description": "This course covers concepts of computation used in analysis of engineering systems. It includes the following topics: data structures, relational database representations of engineering data, algorithms for the solution and optimization of engineering system designs (greedy, dynamic programming, branch and bound, graph algorithms, nonlinear optimization), and introduction to complexity analysis. Object-oriented, efficient implementations of algorithms are emphasized.",
    "authors": [
      "Dr. George Kocur",
      "George Kocur\n\n\n\n\n\n\n                Departments\n              \n\n\n\nCivil"
    ],
    "subject": [
      "Civil and Environmental Engineering",
      "Engineering",
      "Computer Science",
      "Algorithms and Data Structures",
      "Systems Engineering"
    ],
    "source": "MIT",
    "url": "https://ocw.mit.edu/courses/1-204-computer-algorithms-in-systems-engineering-spring-2010/",
    "url_pdf": "",
    "scraped_at": "2025-09-17T06:28:48.431600"
  },
  {
    "id": "aa9069f73f2e5809801bd05c4b0de7b7",
    "title": "Advanced Fluid Dynamics of the Environment",
    "description": "Designed to familiarize students with theories and analytical tools useful for studying research literature, this course is a survey of fluid mechanical problems in the water environment. Because of the inherent nonlinearities in the governing equations, we shall emphasize the art of making analytical approximations not only for facilitating calculations but also for gaining deeper physical insight. The importance of scales will be discussed throughout the course in lectures and homeworks. Mathematical techniques beyond the usual preparation of first-year graduate students will be introduced as a part of the course. Topics vary from year to year.",
    "authors": [
      "Prof. Chiang Mei",
      "Guangda Li"
    ],
    "subject": [
      "Civil and Environmental Engineering",
      "Engineering",
      "Environmental Engineering",
      "Hydrodynamics and Coastal Engineering",
      "Mechanical Engineering",
      "Fluid Mechanics",
      "Ocean Engineering",
      "Hydrodynamics"
    ],
    "source": "MIT",
    "url": "https://ocw.mit.edu/courses/1-63-advanced-fluid-dynamics-of-the-environment-fall-2002/",
    "url_pdf": "",
    "scraped_at": "2025-09-17T06:28:52.192720"
  },
  {
    "id": "8925a19b4b54287c8e8faae09aa3f247",
    "title": "Masters of Engineering Concepts of Engineering Practice",
    "description": "This course is a core requirement for the Masters in Engineering program, designed to teach students about the roles of today's professional engineer and expose them to team-building skills through lectures, team workshops, and seminars. Topics include: written and oral communication, job placement skills, trends in the engineering and construction industry, risk analysis and risk management, managing public information, proposal preparation, project evaluation, project management, liability, professional ethics, and negotiation. The course draws on relevant large-scale projects to illustrate each component of the subject.",
    "authors": [
      "Dr. Eric Adams",
      "Eric Adams\n\n\n\n\n\n\n                Departments\n              \n\n\n\nCivil"
    ],
    "subject": [
      "Civil and Environmental Engineering",
      "Business",
      "Project Management",
      "Engineering",
      "Civil Engineering"
    ],
    "source": "MIT",
    "url": "https://ocw.mit.edu/courses/1-133-masters-of-engineering-concepts-of-engineering-practice-fall-2007/",
    "url_pdf": "",
    "scraped_at": "2025-09-17T06:28:56.059449"
  },
  {
    "id": "a40fc7fd2862cddf21d1e7f713df203f",
    "title": "Introduction to Transportation Systems",
    "description": "1.201J/11.545J/ESD.210J is required for all first-year Master of Science in Transportation students. It would be of interest to, as well as accessible to, students in Urban Studies and Planning, Political Science, Technology and Policy, Management, and various engineering departments. It is a good subject for those who plan to take only one subject in transportation and serves as an entry point to other transportation subjects as well.\n\nThe subject focuses on fundamental principles of transportation systems, introduces transportation systems components and networks, and addresses how one invests in and operates them effectively. The tie between transportation and related systems is emphasized.",
    "authors": [
      "Prof. Joseph Sussman",
      "Prof. Nigel Wilson",
      "Joseph Sussman\n\n\nProf"
    ],
    "subject": [
      "Civil and Environmental EngineeringUrban Studies and PlanningEngineering Systems Division",
      "Social Science",
      "Urban Studies",
      "Transportation Planning"
    ],
    "source": "MIT",
    "url": "https://ocw.mit.edu/courses/1-201j-introduction-to-transportation-systems-fall-2006/",
    "url_pdf": "",
    "scraped_at": "2025-09-17T06:28:59.484370"
  },
  {
    "id": "f051c77da99d33aab9f964fd6dd59759",
    "title": "Introduction to Civil Engineering Design",
    "description": "1.012 introduces students to the theory, tools, and techniques of engineering design and creative problem-solving, as well as design issues and practices in civil engineering. The course includes several design cases, with an emphasis on built facilities (e.g., buildings, bridges and roads). Project design explicitly concerns technical approaches as well as consideration of the existing built environment, natural environment, economic and social factors, and expected life span. A large design case is introduced, which is used in the subsequent specialty area design subjects (1.031, 1.041, 1.051) and the capstone design subject (1.013).",
    "authors": [
      "Prof. Herbert Einstein",
      "Herbert Einstein\n\n\n\n\n\n\n                Departments\n              \n\n\n\nCivil"
    ],
    "subject": [
      "Civil and Environmental Engineering",
      "Engineering",
      "Civil Engineering",
      "Construction Management"
    ],
    "source": "MIT",
    "url": "https://ocw.mit.edu/courses/1-012-introduction-to-civil-engineering-design-spring-2002/",
    "url_pdf": "",
    "scraped_at": "2025-09-17T06:29:03.524091"
  }
]